/**
 * Κβαντικός Παρατηρητής
 * @description Συνείδηση που καταρρέει την κυματοσυνάρτηση
 */
export class Παρατηρητής {
    constructor(id: any, επίπεδοΣυνείδησης?: number);
    id: any;
    επίπεδοΣυνείδησης: number;
    εμπλεγμένοιΠαρατηρητές: Set<any>;
    εμπλέκω(άλλοςΠαρατηρητής: any): void;
}
/**
 * Κβαντικό Φαινόμενο
 * @description Κατάσταση πριν την παρατήρηση
 */
export class Φαινόμενο {
    constructor(κατάσταση: any);
    αρχικήΚατάσταση: any;
    πιθανότητες: Map<any, number>;
    εμπλεγμέναΦαινόμενα: Set<any>;
    προσθήκηΚατάστασης(κατάσταση: any, πιθανότητα: any): void;
    κανονικοποίησηΠιθανοτήτων(): void;
    εμπλέκω(άλλοΦαινόμενο: any): void;
    καταρρέω(παρατηρητής: any): any;
    μοναδικόHash(str: any): number;
}
/**
 * Κβαντική Παρατήρηση
 * @description Καταρρευμένη κατάσταση από υπέρθεση
 */
export class Παρατήρηση {
    constructor(κατάσταση: any, παρατηρητής: any);
    κατάσταση: any;
    παρατηρητής: any;
    χρονικήΣήμανση: number;
}
/**
 * Κβαντικό Δυναμικό
 * @description Πιθανή κβαντική κατάσταση
 */
export class Δυναμικό {
    constructor(κατάσταση: any);
    κατάσταση: any;
    πιθανότητα: number;
}
/**
 * πρα1τικότητα (υποκειμενική πραγματικότητα)
 */
export class πρα1τικότητα {
    constructor(παρατηρητής: any);
    παρατηρητής: any;
    αντίληψη: {};
    παρατηρώ(φαινόμενο: any): any;
}
/**
 * πρα0τικότητα (αντικειμενική πραγματικότητα)
 */
export class πρα0τικότητα {
    υπέρθεση: Map<any, any>;
    εμπλέκω(δυναμικά: any): this;
}
/**
 * Θεμελιώδης φύση της ύπαρξης
 */
export class θ0ός extends πρα0τικότητα {
    είναι: boolean;
    δεν_είναι: boolean;
}
